# Week 4

**Name:** I Adarsh *(PG-12)*<br>
**Registration Number:** 240905294<br>
**Date:** 11/02/2025

In [25]:
import numpy as np
import pandas as pd

# Program 1
Create a ```Series``` from a list of integers representing daily temperatures (in Celsius) over a week. Assign index labels as day of the week.

In [26]:
temps = np.random.randint(-10, 50, size=7)
days = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
temp_series = pd.Series(temps, index=days)
temp_series

Monday       -5
Tuesday      46
Wednesday    43
Thursday     44
Friday       31
Saturday     -1
Sunday       30
dtype: int64

Find and print the average (mean) temperature for the week.

In [27]:
print(f"Mean temperature: {np.mean(temp_series)}")

Mean temperature: 26.857142857142858

Identify and print the maximum and minimum temperatures and their respective days.

In [28]:
print(f"Maximum temperature: {np.max(temp_series)} on {temp_series.idxmax()}")
print(f"Minimum temperature: {np.min(temp_series)} on {temp_series.idxmin()}")

Maximum temperature: 46 on Tuesday
Minimum temperature: -5 on Monday

Display the temperatures greater than a specific value.

In [29]:
val = int(input("Enter a value: "))
greater = temp_series[temp_series > val]
print(f"Temperatures greater than {val}:")
greater

Temperatures greater than 20:

Tuesday      46
Wednesday    43
Thursday     44
Friday       31
Sunday       30
dtype: int64

Convert all temperatures to Fahrenheit.

In [30]:
temp_series_f = (temp_series * 9/5) + 32
print("Temperatures in Fahrenheit:")
temp_series_f

Temperatures in Fahrenheit:

Monday        23.0
Tuesday      114.8
Wednesday    109.4
Thursday     111.2
Friday        87.8
Saturday      30.2
Sunday        86.0
dtype: float64

Print the days had temperatures above the average.

In [31]:
above_avg = temp_series[temp_series > np.mean(temp_series)]
print("Temperatures above average:")
above_avg

Temperatures above average:

Tuesday      46
Wednesday    43
Thursday     44
Friday       31
Sunday       30
dtype: int64

# Program 2
Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3.

In [32]:
import random
import string

def generate_random_name():
    return ''.join(random.choices(string.ascii_lowercase, k=7))

students = {
    'Roll No.': list(range(1, 11)),
    'Name': [generate_random_name() for _ in range(10)],
    'Gender': np.random.choice(['M', 'F'], size=10),
    'Marks1': np.random.randint(0, 100, size=10),
    'Marks2': np.random.randint(0, 100, size=10),
    'Marks3': np.random.randint(0, 100, size=10)
}

df = pd.DataFrame(data=students)
df.set_index('Roll No.', inplace=True)
df

             Name Gender  Marks1  Marks2  Marks3
Roll No.
1         yahvevx      F      68      35      28
2         ylyknkg      F       4      48      43
3         xrxrows      F      19       7      47
4         cnxrtbo      F      28      84      87
5         uegpwls      F      13       1      84
6         fskwfya      F      33       6      44
7         yejzyqn      F      55      78       8
8         vqvkpkn      M      52      37      58
9         fkbxglu      M      44      41      80
10        owlesbn      F      41      24      51

Create a new column with total marks.

In [33]:
df['TotalMarks'] = df['Marks1'] + df['Marks2'] + df['Marks3']
df

             Name Gender  Marks1  Marks2  Marks3  TotalMarks
Roll No.
1         yahvevx      F      68      35      28         131
2         ylyknkg      F       4      48      43          95
3         xrxrows      F      19       7      47          73
4         cnxrtbo      F      28      84      87         199
5         uegpwls      F      13       1      84          98
6         fskwfya      F      33       6      44          83
7         yejzyqn      F      55      78       8         141
8         vqvkpkn      M      52      37      58         147
9         fkbxglu      M      44      41      80         165
10        owlesbn      F      41      24      51         116

Find the lowest marks in ```Marks1```.

In [34]:
print(f"Lowest marks in Marks1: {np.min(df['Marks1'])}")

Lowest marks in Marks1: 4

Find the Highest marks in ```Marks2```.

In [35]:
print(f"Highest marks in Marks2: {np.max(df['Marks2'])}")

Highest marks in Marks2: 84

 Find the average marks in ```Marks3```.

In [36]:
print(f"Average marks in Marks3: {np.mean(df['Marks3'])}")

Average marks in Marks3: 53.0

Find student name with highest average.

In [37]:
df['Average'] = df['TotalMarks'] / 3
df

             Name Gender  Marks1  Marks2  Marks3  TotalMarks    Average
Roll No.
1         yahvevx      F      68      35      28         131  43.666667
2         ylyknkg      F       4      48      43          95  31.666667
3         xrxrows      F      19       7      47          73  24.333333
4         cnxrtbo      F      28      84      87         199  66.333333
5         uegpwls      F      13       1      84          98  32.666667
6         fskwfya      F      33       6      44          83  27.666667
7         yejzyqn      F      55      78       8         141  47.000000
8         vqvkpkn      M      52      37      58         147  49.000000
9         fkbxglu      M      44      41      80         165  55.000000
10        owlesbn      F      41      24      51         116  38.666667

In [38]:
print(f"{df.loc[df['Average'].idxmax(), 'Name']} has the highest average of {df['Average'].max()}")

cnxrtbo has the highest average of 66.33333333333333

Find how many students failed in ```Marks2``` (<40).

In [39]:
print(f"Number of students failed in Marks2: {df[df['Marks2'] < 40].shape[0]}")

Number of students failed in Marks2: 6

# Additional Programs

# Program 1
You are given a CSV file named "sales_data.csv" containing sales records. Your task is to:

In [40]:
csv = pd.read_csv("sales_data.csv")
csv

         Date    Product  Sales
0  2024-01-01  Product A  450.0
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C    NaN
3  2024-01-04  Product A  600.0
4  2024-01-05  Product B    NaN
5  2024-01-06  Product C  700.0

Load the CSV file into a DataFrame.

In [41]:
df = pd.DataFrame(csv)
df

         Date    Product  Sales
0  2024-01-01  Product A  450.0
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C    NaN
3  2024-01-04  Product A  600.0
4  2024-01-05  Product B    NaN
5  2024-01-06  Product C  700.0

Count and display the number of rows that have at least one missing (null) value.

In [42]:
print(f"Number of null values: {df.isnull().sum().sum()}")

Number of null values: 2

Fill the missing values using forward fill (```ffill```).

In [43]:
df.ffill(axis=0, inplace=True)
df

         Date    Product  Sales
0  2024-01-01  Product A  450.0
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C  510.0
3  2024-01-04  Product A  600.0
4  2024-01-05  Product B  600.0
5  2024-01-06  Product C  700.0

Count and display the number of rows where the "Sales" column value is greater than 500.

In [44]:
print(f"Number of rows where sales is greater than 500: {df[df['Sales'] > 500].shape[0]}")

Number of rows where sales is greater than 500: 5

# Program 2
You are given a CSV file named "sales_data.csv" containing sales records. Your task is to:

Load the "sales_data.csv" file and display the first five records.

In [45]:
csv = pd.read_csv("sales_data.csv")
csv

         Date    Product  Sales
0  2024-01-01  Product A  450.0
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C    NaN
3  2024-01-04  Product A  600.0
4  2024-01-05  Product B    NaN
5  2024-01-06  Product C  700.0

In [46]:
csv.iloc[:-1]

         Date    Product  Sales
0  2024-01-01  Product A  450.0
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C    NaN
3  2024-01-04  Product A  600.0
4  2024-01-05  Product B    NaN

Load the "sales_data.csv" file and display the last five records.

In [47]:
csv.iloc[1:]

         Date    Product  Sales
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C    NaN
3  2024-01-04  Product A  600.0
4  2024-01-05  Product B    NaN
5  2024-01-06  Product C  700.0

# Program 3
You are given an Excel file named "sales_data.xlsx" containing sales records. Your tasks are:

Load the Excel file into a DataFrame.

In [48]:
xlsx = pd.read_excel("sales_data.xlsx")
xlsx

         Date    Product  Sales
0  2024-01-01  Product A  450.0
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C    NaN
3  2024-01-04  Product A  600.0
4  2024-01-05  Product B    NaN
5  2024-01-06  Product C  700.0

Load the Excel file into a DataFrame.

In [49]:
df = pd.DataFrame(xlsx)
df

         Date    Product  Sales
0  2024-01-01  Product A  450.0
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C    NaN
3  2024-01-04  Product A  600.0
4  2024-01-05  Product B    NaN
5  2024-01-06  Product C  700.0

Identify and display the number of rows where the "Sales" column has missing (null) values.

In [50]:
print(f"Number of null values: {df.isnull().sum().sum()}")

Number of null values: 2

Fill the missing values using forward fill (```ffill```).

In [51]:
df.ffill(axis=0, inplace=True)
df

         Date    Product  Sales
0  2024-01-01  Product A  450.0
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C  510.0
3  2024-01-04  Product A  600.0
4  2024-01-05  Product B  600.0
5  2024-01-06  Product C  700.0

Count and display the number of rows where the "Sales" column value is less than or equal to 500.

In [52]:
print(f"Number of rows where sales is greater than 500: {df[df['Sales'] <= 500].shape[0]}")

Number of rows where sales is greater than 500: 1

Retrieve and display the first four records from the dataset.

In [53]:
xlsx.iloc[:4]

         Date    Product  Sales
0  2024-01-01  Product A  450.0
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C  510.0
3  2024-01-04  Product A  600.0

Retrieve and display the last two records from the dataset.

In [54]:
xlsx.iloc[-2:]

         Date    Product  Sales
4  2024-01-05  Product B  600.0
5  2024-01-06  Product C  700.0

# Program 4
You are given an Excel file named "sales_data.xlsx" containing sales records. Your tasks are:

In [55]:
xlsx = pd.read_excel("sales_data.xlsx")
xlsx

         Date    Product  Sales
0  2024-01-01  Product A  450.0
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C    NaN
3  2024-01-04  Product A  600.0
4  2024-01-05  Product B    NaN
5  2024-01-06  Product C  700.0

Load the Excel file into a DataFrame.

In [56]:
df = pd.DataFrame(xlsx)
df

         Date    Product  Sales
0  2024-01-01  Product A  450.0
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C    NaN
3  2024-01-04  Product A  600.0
4  2024-01-05  Product B    NaN
5  2024-01-06  Product C  700.0

Use label-based indexing (```.loc```) to retrieve and display the record for "2024-01-03".

In [57]:
df.loc[df['Date'] == '2024-01-03']

         Date    Product  Sales
2  2024-01-03  Product C    NaN

Use label-based indexing (```.loc```) to display the "Product" and "Sales" columns for the record on "2024-01-05".

In [58]:
df.loc[df['Date'] == '2024-01-05', ['Product', 'Sales']]

     Product  Sales
4  Product B    NaN

Use label-based indexing (```.loc```) to display records from "2024-01-02" to "2024-01-05".

In [59]:
df.loc[(df['Date'] >= '2024-01-02') & (df['Date'] <= '2024-01-05')]

         Date    Product  Sales
1  2024-01-02  Product B  510.0
2  2024-01-03  Product C    NaN
3  2024-01-04  Product A  600.0
4  2024-01-05  Product B    NaN

Use label-based indexing (```.loc```) to select all rows where the "Product" is "Product A", displaying only the "Date" and "Sales" columns.

In [60]:
df.loc[df['Product'] == 'Product A', ['Date', 'Sales']]

         Date  Sales
0  2024-01-01  450.0
3  2024-01-04  600.0

Modify the "Sales" value for "2024-01-03" to 550 using ```.loc```, then display the updated row.

In [61]:
df.loc[df['Date'] == '2024-01-03', 'Sales'] = 550
df.loc[df['Date'] == '2024-01-03']

         Date    Product  Sales
2  2024-01-03  Product C  550.0